<?php

return [
    'root' => 'Root',
    
    /*
        |--------------------------------------------------------------------------
        | Buttons
        |--------------------------------------------------------------------------
    */
    'button.save' => 'Сохранить',
    'button.expand_all' => 'Расскрыть все',
    'button.collapse_all' => 'Свернуть все',

    /*
        |--------------------------------------------------------------------------
        | Form
        |--------------------------------------------------------------------------
    */
    'components.tree.buttons.select_all.label' => 'Выбрать все',
    'components.tree.buttons.deselect_all.label' => 'Отменить выбор',
    'components.tree.buttons.expand_all.label' => 'Расскрыть все',
    'components.tree.buttons.collapse_all.label' => 'Свернуть все',
    
    /*
        |--------------------------------------------------------------------------
        | Message
        |--------------------------------------------------------------------------
    */
    'actions.delete.confirmation.with_children' => 'Вы уверены, что удалите эту запись и ее дочерние элементы?',
];